#Parte 1

In [ ]:
import pandas as pd
import mysql.connector
from mysql.connector import Error

def create_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print("Connection to MySQL DB successful")
    except Error as e:
        print(f"The error '{e}' occurred")

    return connection

In [ ]:
host = "relational.fit.cvut.cz"
user = "guest"
pwd = "relational"
connection = create_connection(host_name = host, user_name =user ,user_password = pwd)

1. Obtener el nombre, apellido, salario, título y vigencia del mismo para el empleado 12557. Su resultado se debe de ver de la siguiente manera:

In [ ]:

query = """
            SELECT
                A.emp_no,
                A.first_name,
                A.last_name,
                B.title,
                C.from_date,
                C.to_date,
                C.salary
         FROM employee.employees A  
         LEFT JOIN employee.titles B on A.emp_no = B.emp_no 
         LEFT JOIN employee.salaries C on C.emp_no=A.emp_no
         WHERE A.emp_no = 12557
"""
emp_12557 = pd.read_sql(query,connection)
emp_12557

2. Encontrar el último departamento en el que trabajó el empleado con la siguiente información del mismo: nombre, apellido, número de empleado, fecha de nacimiento, código de departamento, nombre del departamento, fecha cuando inició su trabajo en ese departamento y la fecha cuando concluyó su trabajo

In [ ]:

query = """
        SELECT 
        B.first_name,
        B.last_name,
        B.birth_date,
        C.dept_name,
        A.* 
       FROM (
           SELECT
            dept_no
            ,emp_no
            ,MAX(from_date) Last_dept_date
            ,to_date
            FROM employee.dept_emp
            GROUP BY 1,2,4) A
       LEFT JOIN employee.employees B on A.emp_no = B.emp_no 
       LEFT JOIN employee.departments C ON C.dept_no = A.dept_no
       LIMIT 100
"""
last_dept=pd.read_sql(query,connection)
last_dept

3. Encontrar el salario máximo de cada empleado utilizando la función Partition By con toda la información del empleado y de su salario

In [ ]:

query = """
    SELECT *
    FROM (
        SELECT
            A.emp_no
            ,A.birth_date
            ,A.first_name
            ,A.last_name
            ,A.gender
            ,D.dept_name
            ,B.salary
            ,ROW_NUMBER() OVER (PARTITION BY A.emp_no ORDER BY B.from_date DESC) AS seq
        FROM employee.employees A
        LEFT JOIN employee.salaries B ON B.emp_no = A.emp_no
        LEFT JOIN employee.dept_emp C ON C.emp_no = A.emp_no
        LEFT JOIN employee.departments D ON D.dept_no = C.dept_no
        GROUP BY 1,2,3,4,5,6,7
    ) A
    WHERE seq = 1
    LIMIT 100
"""
pd.read_sql(query,connection)

# Parte 2

Para ver los campos completos utilice la siguiente pagina: https://sqliteonline.com/

In [ ]:
import pandas as pd
import sqlite3
con = sqlite3.connect('sql-murder-mystery.db')
con

In [ ]:
query = """
SELECT name 
  FROM sqlite_master
 where type = 'table'
 
 """
pd.read_sql(query, con)

In [ ]:
query='''SELECT *
     FROM crime_scene_report
     WHERE date=20180115 AND city="SQL City"
     '''
pd.read_sql(query,con)

In [ ]:
query='''SELECT *,
MAX(address_number) Last_house
FROM person
WHERE address_street_name="Northwestern Dr"     
'''
pd.read_sql(query,con)

In [ ]:
query=''' SELECT * FROM person 
WHERE address_street_name="Franklin Ave" AND name="Annabel Miller"
'''
pd.read_sql(query,con)

In [ ]:
query=''' SELECT *
FROM interview
WHERE person_id = 14887 OR person_id = 16371
'''
pd.read_sql(query,con)

In [ ]:
query=''' SELECT *
FROM get_fit_now_check_in
WHERE check_in_date = 20180109
'''
pd.read_sql(query,con)

In [ ]:
query=''' SELECT *
FROM get_fit_now_member
WHERE id="48Z55" OR id="48Z7A"
'''
pd.read_sql(query,con)

In [ ]:
query='''SELECT * 
FROM person
WHERE id="67318"  OR id="28819"

In [ ]:
query=''' SELECT * 
FROM drivers_license
WHERE id="173286"  OR id="423327"
'''
pd.read_sql(query,con)

In [ ]:
cursor = con.cursor()
sql = "INSERT INTO solution VALUES (1, 'Jeremy Bowers')"
cursor.execute(sql)
con.commit()
var = pd.read_sql("SELECT value FROM solution", con)
var.iloc[0,0]

In [ ]:
query='''SELECT * 
FROM interview
WHERE person_id = "67318"
'''
pd.read_sql(query,con)

In [ ]:
query='''
    SELECT *
    FROM (
        SELECT
            A.height,
            A.hair_color,
            A.gender,
            A.car_model,
            B.id,
            B.name,
            C.event_name
        FROM drivers_license A
        LEFT JOIN person B on A.id = B.license_id
        LEFT JOIN facebook_event_checkin C on B.id = C.person_id
        GROUP BY 1,2,3,4,5,6,7
    ) A
    WHERE (A.hair_color="red" AND A.gender="female" AND A.car_model="Model S") AND A.height BETWEEN 65 AND 67
     '''
pd.read_sql(query,con)

In [ ]:
cursor = con.cursor()
sql = "INSERT INTO solution VALUES (1, 'Miranda Priestly')"
cursor.execute(sql)
con.commit()
var = pd.read_sql("SELECT value FROM solution", con)
var.iloc[0,0]